[
  {
    "name": "DWYANE RAMOS",
    "bio": "Arguably New Zealand’s greatest overall cuber, Dwyane has been on fire since the very beginning. He broke the National Record average for Skewb at his debut competition - a statement of intent that he's backed up by dominating the event ever since. He wasn't limited to Skewb though, as within just a couple of years he'd solidified his status as New Zealand’s best all-rounder. He’s set National or Oceanic Records in almost half of the official events, from 3x3, to big cubes, to sprint events and even Square-1.<br/><br/>His best event has to be One-Handed, however: since first breaking the One-Handed National Records in 2020, he's been unstoppable. He rapidly became one of the fastest solvers in the world, showcasing the power of the Roux method and ranking 3rd globally at his peak.<br/><br/>Perhaps Dwyane’s most impressive trait though has been his ability to thrive under pressure. At the inaugural Oceanic Championship in 2022, Dwyane didn't only win his two main events, but also became the Oceanic Champion for 3x3, beating out a field that included some of the greatest cubers of all time. Two years later in Perth, Dwyane defended that title, becoming the back-to-back Oceanic Champion and remaining the sole winner of the title.",
    "file": "dwyane.webp",
    "wcaid": "2019RAMO05",
    "instagram": "https://www.instagram.com/2019ramo05/",
    "youtube": "https://www.youtube.com/@dwyaneramos4208"
  },
  {
    "name": "ANGELA BRAGANZA",
    "bio": "With experience beyond her years, Angela has been competing since she was just eight years old! She saw steady improvement for her first few years, gradually rising through the rankings. Over time her consistency was rewarded, and she became one of the country’s best solvers in the larger NxN events.<br/><br/>2021 was a breakthrough year for her, as she finally managed to claim the National Record for 4x4, her main event. Since then she's continued to flourish, setting a total of 10 NRs, consistently medalling at Nationals and even Oceanics, and establishing herself as the fastest female 4x4 solver in the world!",
    "file": "angela.webp",
    "wcaid": "2015BRAG01",
    "instagram": "https://www.instagram.com/azzabee456/",
    "youtube": "https://www.youtube.com/@angelabraganza8305"
  },
  {
    "name": "JASPER MURRAY",
    "bio": "As New Zealand’s first ever World Record holder, Jasper holds a special place in our history. Since their very first competition, they showcased an unwavering dedication to perfecting Pyraminx, their main event. Over the years they continuously improved, setting new records in almost every competition, and meticulously refining every element of their solving style. This culminated in Twisty Taranaki 2022, where all their hard work and perseverance was finally rewarded with a 1.66 second World Record average!<br/><br/>Since then, Jasper has remained one of the top Pyraminx solvers in the world, setting another World Record the following year and collecting a handful of Oceanic Records along the way. They’ve also expanded into other events, becoming one of the country’s best solvers in 5x5, One-Handed, and 3x3, where they previously held the National Record with a 6.00 average. At the 2025 World Championship, they proved that versatility beyond any doubt, winning a bronze medal in One-Handed on cubing's biggest stage.",
    "file": "jasper.webp",
    "wcaid": "2018MURR03",
    "instagram": "https://www.instagram.com/jaspermurray_speedcuber/",
    "youtube": "https://www.youtube.com/@jmurraynz"
  },
  {
    "name": "JAMES MACDIARMID",
    "bio": "James is one of New Zealand’s most experienced cubers, with a competitive career spanning a decade and five continents. He dabbled with a variety of events for his first few years, but soon settled on Megaminx as his main focus. From 2017 to 2020 he cut New Zealand’s Megaminx times almost in half, amassing 30 National Records in the process.<br/><br/>During the COVID-19 lockdowns, James shifted his focus towards blindfolded solving, specialising in Multi-Blind. He soon emerged as one of the top Multi-Blind solvers in Oceania, and saw steady improvement over the next two years. A breakout year then came in 2024, when he finally managed to claim the Oceanic Record, and won the Oceanic Championship in Perth.<br/><br/>Since then he's continued to shine, dominating the Oceanic Multi-Blind rankings in 2025, rising to top 10 in the World, and bringing home a silver medal at the World Championship!",
    "file": "james.webp",
    "wcaid": "2015MACD03",
    "instagram": "https://www.instagram.com/macdiarmidjames/",
    "youtube": "https://www.youtube.com/@jamesmacdiarmid"
  },
  {
    "name": "ALEXANDER VUJCICH",
    "bio": "Alexander hit the ground running with his cubing career, and has hardly slowed down since! He had a singular focus on Megaminx from the first time he touched the puzzle, and at New Zealand Nationals 2019 (his very first competition) managed to claim a bronze medal. A year later he was National Champion, and he’s dominated the event ever since. By mid-2022 he’d cemented his name as the best Megaminx solver in Oceania, and among the best in the world… which he backed up at the 2023 World Championship, where he brought home a bronze medal!<br/><br/>After breaking the Oceanic Record in Megaminx over a dozen times, Alexander has begun to broaden his focus, becoming a serious threat for several other events. Today, he remains one of the world’s top Megaminx solvers, and has recently been on a roll with 4x4 and 5x5 as well, setting almost 20 National Records between the two events.",
    "file": "alex.webp",
    "wcaid": "2019VUJC01",
    "instagram": "https://www.instagram.com/alexvujcich/",
    "youtube": ""
  },
  {
    "name": "TOM NELSON",
    "bio": "One of New Zealand’s veteran cubers, Tom’s been competing for over a decade. Right from the start he was specialising in the blindfolded events, achieving New Zealand’s first Multi-Blind success at his very first competition. Over the following years he racked up dozens of National and Oceanic Records, regularly putting down world-class results in the longer blindfolded events. This culminated in the 2017 World Championship in Paris, where Tom managed to win 5x5 Blindfolded against the very best from around the world (becoming New Zealand’s first World Champion!)<br/><br/>Tom continued to dominate blindfolded events in New Zealand right into the 2020s, with his winning streak at Nationals lasting over seven years. In recent years though he’s shifted his focus towards Fewest Moves solving, where he’s become by far the most efficient solver in New Zealand. With seven National Records and four National Titles for Fewest Moves under his belt already, what will he do next?",
    "file": "tom.webp",
    "wcaid": "2013NELS01",
    "instagram": "https://www.instagram.com/cyansandwich/",
    "youtube": "https://www.youtube.com/@TomNelson1"
  },
  {
    "name": "CONNOR JOHNSON",
    "bio": "Connor started out his cubing career with a bang, getting a 0.69 second 2x2 single at his very first competition… good enough to rank him top 50 in the world already, and marking the fastest solve ever done by a first-time competitor! Since then he’s gone from strength to strength, becoming an extremely solid, well-rounded cuber, with a special talent for the “sprint events” (events that are solved in just a few seconds, and rely on planning and incredible turn speed).<br/><br/>2024 saw Connor establish himself as New Zealand’s premier 2x2 solver, averaging well below 2 seconds with remarkable consistency. He won his first national title at the end of the year, and at his first competition of 2025 he crushed both 2x2 National Records, with a clutch 1.28 average and a 0.47 single that ranked him third in the world!",
    "file": "connor.webp",
    "wcaid": "2022JOHN14",
    "instagram": "https://www.instagram.com/connor_johnson_speedcuber/",
    "youtube": "https://www.youtube.com/@ConnorJohnson2"
  },
  {
    "name": "ADRIEN AUVRAY MATYN",
    "bio": "Adrien is one of our most complete cubers, having both a phenomenal talent for Square-1 and a remarkably well-rounded skillset. He started his career off as largely a 3x3 specialist, managing a silver medal at Nationals in his second year of competing, and a National Record in his third. <br/><br/>Since then he’s remained one of our fastest 3x3 solvers, and has also excelled in a range of other disciplines - particularly the “side events” (events that aren’t solving an NxN cube). He was the inaugural Oceanic Champion for Clock, and since 2021 has dominated in Square-1: after claiming his first National Record in the event four years ago, Adrien has proven untouchable, beating his own records a further 13 times and climbing to be ranked top 10 in the world.",
    "file": "adrien.webp",
    "wcaid": "2018MATY02",
    "instagram": "https://www.instagram.com/adweeham/",
    "youtube": "https://www.youtube.com/@AdrienAuvrayMatyn"
  },
  {
    "name": "CHRIS MILLS",
    "bio": "Chris is our most experienced cuber, with almost 150 competition appearances dating back to 2014! He's also a cuber of two countries - with dual citizenship, he initially chose to compete under the UK flag, but was a regular attendee at New Zealand Nationals too. A 3x3 specialist, he gradually rose up the UK rankings, and after five years of steady practice had become one of the UK's fastest. In 2019 he finally claimed both 3x3 National Records, with a 5.00 single and 7.27 average. He went on to break seven more NRs for the UK, becoming the country's standout 3x3 solver.<br/><br/>Since the COVID-19 pandemic however, Chris has started spending most of his time in New Zealand. He’s quickly become a key part of the community here, and in 2024 started competing for New Zealand rather than the UK. Immediately he was one of our fastest 3x3 solvers, and broke the National Record average in his very first competition under the NZ flag. Since then he's remained an amazing 3x3 solver, and today also excels in a variety of other events, including Megaminx, 4x4, and One-Handed.",
    "file": "chris.webp",
    "wcaid": "2014MILL04",
    "instagram": "https://www.instagram.com/chrismills.speedcuber/",
    "youtube": "https://www.youtube.com/@ChrisMillsSpeedcuber"
  },
  {
    "name": "ELYAS EYOU",
    "bio": "Elyas has long been an amazing, friendly cuber at the heart of our community. After discovering a love for Pyraminx in early 2020, he pursued the event tirelessly and soon became a force to be reckoned with. Paired with Jasper Murray, who was quickly approaching the World Record, the two made Pyraminx into New Zealand’s strongest event. Together they set many of the fastest podiums of all time, and Elyas’s relentless improvement saw him peak ranked 4th in the world. In 2024 he travelled to Perth for the Oceanic Championship… and came away with gold, finally winning on the big stage!<br/><br/>Elyas has also been one of our strongest 2x2 solvers for several years. Starting with a shocking 1.53 second Oceanic Record average in 2022, he went on a roll, winning Nationals that year and proving he had the skill to excel in multiple areas.<br/><br/>Today, he remains a top competitor in several events - and as the reigning Oceanic Champion, one of the world’s foremost talents for Pyraminx.",
    "file": "elyas.webp",
    "wcaid": "2018EYOU02",
    "instagram": "https://www.instagram.com/elyaseyou_speedcuber/",
    "youtube": "https://www.youtube.com/@ElyasEyouNZ"
  },
  {
    "name": "LACHLAN GIBSON",
    "bio": "One of New Zealand’s newest talents, Lachlan is already an all-time great! His first year of competing saw solid improvement in a variety of events, but the real magic happened when he started to practice Clock. After learning to solve the puzzle at the end of 2023, it quickly became Lachlan’s main event, and over the following year he rose through the rankings at a staggering rate. By the middle of 2024 he was already the best in New Zealand, and by the end of the year he’d broken the Oceanic Record three times and was ranked second in the world. In just his first competition of 2025 he set his first World Record, with a 1.86 second single - and since then he's been on a roll, breaking the World Record Average twice and solving with unprecedented consistency.<br/><br/>In barely over a year, Lachlan has gone from not knowing how to solve Clock, to being the fastest solver in history. We can’t wait to see what he does next!",
    "file": "lachie.webp",
    "wcaid": "2022GIBS04",
    "instagram": "https://www.instagram.com/lachieg_cubing/",
    "youtube": "https://www.youtube.com/@LachieGibson-cubing/videos"
  },
  {
    "name": "HENRY EYLES",
    "bio": "As one of our most multi-talented cubers, Henry has excelled in a wide range of different events. He burst into the spotlight in 2022 with a surprise Skewb podium at the Oceanic Championship - and since then has racked up a huge collection of medals, at almost every comp he attends.<br/><br/>He bounced between events for his first couple of years, becoming one of our best all-rounders… but struggling to quite rise to the top level for any specific event, with National titles and records mostly eluding him. 2024 proved to be a breakout year, however. With a dual focus on Square-1 and big cubes, Henry secured 4 medals at Nationals and 3 at Oceanics, and even became the Oceanic Champion for 6x6 and Square-1. He then built on that success in 2025, breaking all 4 National Records for 6x6 and 7x7, and winning both events at Nationals.<br/><br/>Despite competing for over 4 years, Henry is still rapidly improving, and it feels like he's really starting to hit his stride now. We’re super excited to see what he can do over the coming years - in big cubes especially, but we’re sure he'll surprise us in other events while he's at it!",
    "file": "henry.jpg",
    "wcaid": "2021EYLE01",
    "instagram": "https://www.instagram.com/henryeyles",
    "youtube": "https://www.youtube.com/@henryeyles"
  }
]
